sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getEntryList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getEntryList">
   <soapenv:Header/>
    <soapenv:Body>
       <sug:sugarcrmUrl>https://gogqcl5763.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
         <sug:session>rii38b9qfk58hp8lqreq2s55m5</sug:session>             
         <sug:module_name>Contacts</sug:module_name>
         <sug:query></sug:query>
         <sug:order_by></sug:order_by>
         <sug:offset>0</sug:offset>
         <sug:select_fields>
            	<item>assigned_user_name</item>
         	<item>assigned_user_id</item>
         </sug:select_fields>
         <sug:max_results>2</sug:max_results>
         <sug:deleted >0</sug:deleted>
         <sug:favorites>false</sug:favorites>
   </soapenv:Body>
</soapenv:Envelope>
